#pandas merging() function...

In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame({'id':[1,2,3,4],
                'class':[9,10,11,12]})
df1

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

In [3]:
df2=pd.DataFrame({'id':[1,2,3,4],
                 'name':['A','B','C','D']})
df2

   id name
0   1    A
1   2    B
2   3    C
3   4    D

In [4]:
pd.merge(df1,df2,on='id')

   id  class name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12    D

In [5]:
pd.merge(df2,df1,on='id')

   id name  class
0   1    A      9
1   2    B     10
2   3    C     11
3   4    D     12

#if id colummn is not same

In [6]:
df3=pd.DataFrame({'id':[1,2,3,5],
                 'name':['A','B','C','D']})
df3

   id name
0   1    A
1   2    B
2   3    C
3   5    D

In [7]:
pd.merge(df1,df3,on='id')

   id  class name
0   1      9    A
1   2     10    B
2   3     11    C

#how

In [8]:
pd.merge(df1,df3,on='id',how='inner')   #by default it take how=inner..means intersection

   id  class name
0   1      9    A
1   2     10    B
2   3     11    C

In [9]:
pd.merge(df1,df3,on='id',how='left') #how=left give prioritize left one in this priority =df1

   id  class name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [10]:
pd.merge(df1,df3,on='id',how='right') #how=right give prioritize right one in this priority =df3

   id  class name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   5    NaN    D

In [11]:
pd.merge(df1,df3,on='id',how='outer') #how=outer means union

   id  class name
0   1    9.0    A
1   2   10.0    B
2   3   11.0    C
3   4   12.0  NaN
4   5    NaN    D

#indicator paramter to know the information of each row

In [12]:
pd.merge(df1,df3,on='id',how='outer',indicator='True')  #by default indicator take value False

   id  class name        True
0   1    9.0    A        both
1   2   10.0    B        both
2   3   11.0    C        both
3   4   12.0  NaN   left_only
4   5    NaN    D  right_only

In [13]:
#if index of both dataframe are different

In [14]:
df1

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

In [15]:
df4=pd.DataFrame({'id':[5,6,7,8],
                 'name':['A','B','C','D']})
df4

   id name
0   5    A
1   6    B
2   7    C
3   8    D

In [16]:
pd.merge(df1,df4,left_index=True,right_index=True)

   id_x  class  id_y name
0     1      9     5    A
1     2     10     6    B
2     3     11     7    C
3     4     12     8    D

In [17]:
pd.merge(df1,df4)

Empty DataFrame
Columns: [id, class, name]
Index: []

In [18]:
df5=pd.DataFrame({'id':[1,2,3,4],
                'class':[9,10,11,12]})
df5

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

In [19]:
pd.merge(df1,df5)

   id  class
0   1      9
1   2     10
2   3     11
3   4     12

In [20]:
pd.merge(df1,df5,on='id')

   id  class_x  class_y
0   1        9        9
1   2       10       10
2   3       11       11
3   4       12       12

#suffix()

In [21]:
import pandas as pd

In [24]:
pd.merge(df1,df5,on='id',suffixes=('_higher','_lower'))

   id  class_higher  class_lower
0   1             9            9
1   2            10           10
2   3            11           11
3   4            12           12